% Задание 2
% выполните вычисление и построение фигур Лиссажу для разных отношений и
% для разных значений амплтуд
a1 = [1.2, 10.4, -4.2, -8.5, 2.1];
a2 = [1.0, 4.4, -2.3, 1.8, -5.6];
w1 = [1.5, 2.2, 4.5, -3, -6.3, 4.1];
w2 = [1.0, 5.1, -1, 2.2, -1.1, 4.2];
% Оператор задания вектора значений t
t = 0:0.1:10;
% Вычисление векторов x, y
x = a1(1) * cos(w1(1) * t);
y = a2(1) * cos(w2(1) * t);
n = 5;
for i = 2:5
    x(i,:) = a1(i) * cos(w1(i) * t);
    y(i,:) = a2(i) * cos(w2(i) * t);
end
plot(x(1), y(1), x(2), y(2), x(3), y(3))